app/controllers/mails_controller.rb

SELECT "mails".* FROM "mails" WHERE "mails"."category_id" = $1  [["category_id", 1]]
---
  def inbox
    @inboxes = Mail.where(category_id:1)

SELECT "mails".* FROM "mails" WHERE "mails"."category_id" = $1  [["category_id", 2]]
---
  def sendbox
    @send_boxes = Mail.where(category_id:2)

SELECT "mails".* FROM "mails" WHERE "mails"."category_id" = $1  [["category_id", 2]]
---
  def draft
    @drafts = Mail.where(category_id:3)

SELECT "mails".* FROM "mails" WHERE "mails"."category_id" = $1 AND "mails"."is_readed" = $2  [["category_id", 1], ["is_readed", "t"]]
---
  def read
    @read = Mail.where(category_id:1, is_readed:true)

SELECT "mails".* FROM "mails" WHERE "mails"."category_id" = $1 AND "mails"."is_readed" = $2  [["category_id", 1], ["is_readed", "f"]]
---
  def unread
     @unread = Mail.where(category_id:1, is_readed:false)