app/controllers/users_controller.rb

  def index
    @mails = MyMail.all
---
SELECT "mails".* FROM "mails"